Tekla.Structures.Plugins.PropertyPane.Dual
The dual property enum.

Tekla.Structures.Plugins.PropertyPane.Dual.None
The None.

Tekla.Structures.Plugins.PropertyPane.Dual.Numbering
The numbering.

Tekla.Structures.Plugins.PropertyPane.Dual.OnPlane
The on plane.

Tekla.Structures.Plugins.PropertyPane.Dual.Depth
The depth.

Tekla.Structures.Plugins.PropertyPane.Dual.String
The dual string.

Tekla.Structures.Plugins.PropertyPane.Dual.Integer
The dual integer.

Tekla.Structures.Plugins.PropertyPane.Dual.Distance
The dual distance.

Tekla.Structures.Plugins.PropertyPane.Dual.Angle
The dual angle.

Tekla.Structures.Plugins.PropertyPane.Dual.Boolean
The dual boolean.

Tekla.Structures.Plugins.PropertyPane.Dual.Label
The dual label.